import "./ReturnExchangePage.css";

interface Props {
  goHome: () => void;
  openDeliveryPaymentPage: () => void;
}

const ReturnExchangePage = ({
  goHome,
  openDeliveryPaymentPage,
}: Props) => {
  return (
    <main className="return-page">
      <button className="return-back" onClick={goHome}>
        ← На головну
      </button>

      <div className="return-breadcrumbs">
        Головна / Повернення та обмін
      </div>

      <h1>Повернення та обмін</h1>

      <div className="return-layout">
        <aside className="return-tabs">
          <button onClick={openDeliveryPaymentPage}>
            Доставка та оплата
          </button>

          <button className="active">
            Повернення та обмін
          </button>
        </aside>

        <section className="return-content">
          <p>
            Lenovo завжди на вашій стороні! Тому будь-який придбаний у
            SHOP.LENOVO.UA товар можна повернути або обміняти без пояснення
            причин.
          </p>

          <p>
            У Lenovo обміняють товар або повернуть кошти, якщо:
          </p>

          <ul>
            <li>з моменту придбання НЕ минуло 14 днів;</li>
            <li>товар не має слідів експлуатації;</li>
            <li>
              збережено товарний вигляд виробу та його комплектуючих:
              відсутнє механічне пошкодження, подряпини, потертості, а для
              товарів в одноразовій упаковці — якщо упаковку не розкривали;
            </li>
            <li>в наявності касовий рахунок або видаткова накладна;</li>
            <li>збережені заводські пломби, захисні плівки на товарі.</li>
          </ul>

          <p>
            Умови обміну та повернення товару згідно чинним{" "}
            <a>законодавством України.</a>
          </p>

          <p>При собі необхідно мати:</p>

          <ol>
            <li>
              Документ, який підтверджує придбання товару
              (касовий чек або видаткова накладна);
            </li>
            <li>Гарантійний талон;</li>
            <li>
              Пластикову картку, за допомогою якої відбувався розрахунок;
            </li>
            <li>
              Документ державного зразка, який посвідчує особу
              (паспорт, водійські права, студентський квиток, пенсійне
              посвідчення).
            </li>
          </ol>

          <p>
            Для повернення вашого замовлення звертайтесь за номером{" "}
            <b>0 800 30 00 33</b>. Повернення товару здійснюється через службу
            доставки «Нова Пошта». Оформити заявку на повернення можна
            заповнивши <a>заяву</a> і відправивши її нам{" "}
            <a>online-shop@lenovo.ua</a>.
          </p>
        </section>
      </div>
    </main>
  );
};

export default ReturnExchangePage;