import { useState } from "react";
import "./LenovoInfo.css";

const LenovoInfo = () => {
  const [open, setOpen] = useState(false);

  return (
    <section className="lenovo-info">
      <div className="lenovo-info-card">
        <h2>Lenovo — досягати більшого</h2>

        <h3>Підкорюй нові вершини з Lenovo</h3>

        <p>
          Справжньому лідеру й новатору недостатньо просто йти в ногу із часом.
          Його завдання — створювати і втілювати ідеї, актуальні в майбутньому.
          Легко адаптуватися, гнучко реагувати на зміни, упевнено рухатися до
          своєї мети та долати будь-які перешкоди. Це — філософія компанії Lenovo.
          Якщо наші ідеї відгукуються тобі, запрошуємо розділити шлях до успіху — безкінечно вперед!
        </p>

        {open && (
          <div className="lenovo-full-text">
            <h3>Прагнення досягати більшого — сьогодні, завтра, завжди</h3>
            <p>
              Історія компанії Lenovo почалася в 1985 році. Тоді Лю Чуаньчжі —
              молодий учений із Китаю — з командою інженерів розробив
              інноваційну друковану плату.Цей винахід спростив китайські ієрогліфи для комп’ютерів IBM і став справжнім проривом. Тепер світ ПК відкрився і для жителів Китаю.
            </p>
            <p>Непереборне бажання залишатися «першопрохідцями» і приймати складні виклики вплинуло на розвиток компанії. Далі були перший персональний комп’ютер із процесором Intel Pentium 586, перший сервер і перший ноутбук. Шлях компанії Lenovo із самого початку був низкою технологічних інновацій і яскравих проривів. Це лишається незмінним і сьогодні.</p>

            <h3>Шлях інноваторів</h3>
            <p>
              Компанія Lenovo пропонує нестандартні рішення і створює пристрої,
              які ефективно виконують завдання користувачів. В онлайн-каталозі
              магазину ти знайдеш ноутбуки, смартфони, планшети, серверні рішення
              та периферію.
            </p>
            <p>Експерименти тривають! Інженери Lenovo розробляють унікальні продукти, такі як пристрої «2-в-1» YOGA, у яких продуктивність ноутбука вдало доповнена портативними можливостями планшета. Ця запатентована Lenovo розробка відкрила креативним користувачам нові інструменти для творчості. У 2021 році компанія представила інноваційний ноутбук <span className="lenovo-link">Lenovo ThinkPad X1 Fold</span> — перший у світі комп’ютер із гнучким екраном, який можна складати навпіл.</p>

            <h3>Космічна надійність — у кожному офісі</h3>
            <p>
              Легендарна лінійка <span className="lenovo-link">ThinkPad</span> уже багато років зберігає репутацію
              супернадійної техніки для бізнес-користувачів у всьому світі.Настільки надійної, щоб працювати на МКС або в екстремальних експедиціях в умовах арктичних морозів.
            </p>
            <p>Секрет дивовижної витривалості цих ноутбуків у тому, що кожен пристрій проходить 12 перевірок і 20 процедур за стандартом MIL-STD-810G, а у власних лабораторіях Lenovo — ще понад 200 не менш суворих випробувань на міцність і працездатність. Ці «міцні горішки» приймають будь-які виклики: спека чи мороз, бруд або пісок, тиск, трясіння чи пролита рідина*. Супервитривалість удосконалюють у кожному новому пристрої.</p>
            <p>*У реальному житті не повторювати. Компанія не гарантує функціонування пристроїв під час використання в подібних умовах тестування. У випадках неправильного використання ноутбуків гарантії Lenovo не діють.</p>

            <h3>Нестримна потужність Legion</h3>
            <p>Лаконічний дизайн корпусу й можливості, від яких перехоплює подих, — це лінійка <span className="lenovo-link">Legion</span>. Ультрапотужні процесори, на продуктивність яких раніше покладалися лише користувачі ПК, доступні в портативних ноутбуках. Ігрові моделі Legion стали ще одним проривом Lenovo: тепер компактним пристроям до снаги вимогливі до ресурсів завдання.</p>
            <p>Правильне доповнення такої потужності — збільшений об’єм оперативної пам’яті та професійні дискретні відеокарти, ефективна терморегуляція і точне керування. Ноутбуки ігрової серії з двома незалежними накопичувачами отримали дивовижні мультимедійні можливості. За відтворення кінематографічного звучання відповідає акустика Harman, екрани з роздільною здатністю до 4K дають змогу повністю поринути в чітке реалістичне зображення. Залишилося додати: портативність і лаконічний дизайн зробили Legion однаково доречним на кіберспортивному змаганні та бізнес-зустрічі.</p>
            <h3>YOGA — визначні пристрої для кожного</h3>
            <p>Сучасні користувачі цінують універсальні та мобільні рішення. Навіщо носити із собою чотири окремі пристрої, коли є мультирежимні <span className="lenovo-link">YOGA</span>? У витонченому корпусі поєднані можливості ноутбука та планшета, режими «стенд» і «тент» підійдуть для перегляду кіно та проведення презентацій. Або вибирай YOGA Slim — ультратонкі ноутбуки із вражаючими мультимедійними опціями. Розкривай креативний потенціал, пиши просто на екрані — встигай ще більше завдяки дивовижним можливостям <span className="lenovo-link">YOGA</span>.</p>
            <h3>Мобільність із портативними планшетами</h3>
            <p>Якщо можливостей смартфона недостатньо для розваг і вирішення робочих питань, інтернет-магазин Lenovo в Україні з продуманою системою фільтрів допоможе підібрати відповідний планшет. Багаторежимні пристрої <span className="lenovo-link">YOGA Book</span>, а може, <span className="lenovo-link">Miix</span>, оснащений знімною клавіатурою для зручної роботи? Витончені й портативні планшети <span className="lenovo-link">YOGA Tab</span> або <span className="lenovo-link">Lenovo Tab </span> стануть центром розваг для всієї родини.</p>
            <h3>Усе під контролем — периферія і аксесуари</h3>
            <p>Подбати про захист дисплеїв планшетів, підібрати зручну та стильну <span className="lenovo-link">сумку</span> чи рюкзак для подорожей з улюбленими пристроями, знайти клавіатури, мишки, навушники, перехідники — усе це легко. Аксесуари та периферія Lenovo дадуть змогу зробити використання техніки максимально комфортним і ефективним.</p>

            <h3>Справжня турбота про користувачів</h3>
            <p>
              Ми не просто заявляємо про комфорт, а ставимо перед собою завдання — надавати найкращий користувацький досвід. В онлайн-магазині легко отримати вичерпну інформацію про кожну модель пристроїв, включно з вичерпний описом, актуальними цінами та детальними фото. Якщо потрібна додаткова інформація для прийняття рішення, заходь на портал Lenovo, щоб залишатися в курсі новин бренда й виходу новинок, ознайомитися з рекомендаціями щодо вибору та використання техніки, надихнутися історіями інноваторів, яким пристрої Lenovo допомагають змінювати світ на краще.
            </p>
            <p>В онлайн-каталозі магазину ти знайдеш універсальні пристрої ideapad для нескладних завдань, суперзахищені та продуктивні ThinkPad і витончені ThinkBook, Legion — для геймерів, а також мультирежимні ноутбуки YOGA. Смартфони, планшети й навіть серверні рішення та зручна периферія — в офіційному інтернет-магазині Lenovo купити все необхідне можна за один клік. Створюй цілісну екосистему взаємодоповнювальних пристроїв для найбільшої продуктивності</p>
            <p>Експерименти тривають! Інженери Lenovo розробляють унікальні продукти, такі як пристрої «2-в-1» YOGA, у яких продуктивність ноутбука вдало доповнена портативними можливостями планшета. Ця запатентована Lenovo розробка відкрила креативним користувачам нові інструменти для творчості. У 2021 році компанія представила інноваційний ноутбук Lenovo ThinkPad X1 Fold — перший у світі комп’ютер із гнучким екраном, який можна складати навпіл.</p>
             <h3>Завжди йти своїм шляхом</h3>
             <p>У слогані «Безкінечно вперед» втілена філософія Lenovo. Це девіз тих, хто звик чітко бачити власні цілі, продовжувати рух до них, не зважаючи на перешкоди й не озираючись. Lenovo — команда новаторів, які не йдуть за трендами, а самі встановлюють напрями розвитку техніки сьогодні й у майбутньому. Будь із нами — будь на хвилі інновацій!</p>
          </div>
        )}

        <button
          className="read-more-btn"
          onClick={() => setOpen(!open)}
        >
          {open ? "Згорнути" : "Читати повністю"}
        </button>
      </div>
    </section>
  );
};

export default LenovoInfo;